/*******************************************************************************************************
Definition: File to communicate with the terminal
Developer: Trishin Vadim
Notes: 
*******************************************************************************************************/
/*******************************************************************************************************
Описание: Файл для связи с терминалом
Разработчик: Тришин Вадим
Заметки: 
*******************************************************************************************************/
#include "debug.h"
#include <stm32f10x.h>
//#include "stm32f10x_usart.h"

/***************************************************************************************************
Local defines
***************************************************************************************************/
/***************************************************************************************************
Локальные дефайны
***************************************************************************************************/

/***************************************************************************************************
Local data types
***************************************************************************************************/
/***************************************************************************************************
Локальные типы данных
***************************************************************************************************/

/***************************************************************************************************
File local variables
***************************************************************************************************/
/***************************************************************************************************
Локальные переменные файла
***************************************************************************************************/

/***************************************************************************************************
Global functions
***************************************************************************************************/
/***************************************************************************************************
Глобальные функции
***************************************************************************************************/

/**************************************************************************************************
Definition: Initializating USART 
Arguments: No
Return:   No
Notes: To communicate with the terminal
**************************************************************************************************/
/**************************************************************************************************
Описание: Инициализация USART 
Аргументы: Нет
Возврат:   Нет
Замечания: Для обмена данными с терминалом
**************************************************************************************************/
void init_USART1(void)
{
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA , ENABLE);
	GPIO_InitTypeDef structGPIO;
  //GPIO_StructInit(&structGPIO);
	
	structGPIO.GPIO_Speed = GPIO_Speed_2MHz;
	
  // USART1_TX, TIM1_CH2
  structGPIO.GPIO_Pin  = GPIO_Pin_9;
  structGPIO.GPIO_Mode = GPIO_Mode_Out_PP; // Check
  GPIO_Init(GPIOA, &structGPIO);
  // USART1_RX, TIM1_CH3
  structGPIO.GPIO_Pin  = GPIO_Pin_10; 
  structGPIO.GPIO_Mode = GPIO_Mode_AF_PP; // Check
  GPIO_Init(GPIOA, &structGPIO);
	
  // PA9_10 - USART1
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 , ENABLE);
  
  USART_InitTypeDef structUSART;
  
  USART_StructInit(&structUSART);
  structUSART.USART_BaudRate = 115200; // Is it correct baud?
  USART_Init(USART1, &structUSART);
  
  USART_ITConfig(USART1, USART_IT_RXNE, ENABLE); // Turns on RX interrupt
  //USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
	NVIC_EnableIRQ(USART1_IRQn);
  
  USART_Cmd(USART1, ENABLE);
}

/**************************************************************************************************
Definition: Initializating TIM 
Arguments: No
Return:   No
Notes:
**************************************************************************************************/
/**************************************************************************************************
Описание: Инициализация TIM 
Аргументы: Нет
Возврат:   Нет
Замечания:
**************************************************************************************************/
void init_TIM1(void)
{
	const uint16_t period = 1000;
	const uint16_t freq = 1000;
	
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1,ENABLE);
  
	TIM_TimeBaseInitTypeDef structTIM;
    
	structTIM.TIM_ClockDivision = TIM_CKD_DIV1;
	structTIM.TIM_CounterMode = TIM_CounterMode_Up;
	structTIM.TIM_Period = period - 1; // period 1ms ?
	structTIM.TIM_Prescaler = SystemCoreClock / freq - 1; // frequency 1ms
	structTIM.TIM_RepetitionCounter = 0;
	
	TIM_TimeBaseInit(TIM1, &structTIM);
	
	TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);
	
	//NVIC_SetPriority(TIM1_UP_IRQn, 2);
	NVIC_EnableIRQ(TIM1_UP_IRQn);
	
	TIM_Cmd(TIM1, ENABLE);
}

/**************************************************************************************************
Definition: Interrupt from USART 
Arguments: No
Return:   No
Notes: Waiting for new messageand setting new speed if value in message = -2048..2047
**************************************************************************************************/
/**************************************************************************************************
Описание: Прерывание от АЦП
Аргументы: Нет
Возврат:   Нет
Замечания: Ожидание нового сообщения и установка скорости, если значение в сообщении = -2048..2047
**************************************************************************************************/
void USART1_IRQHandler(void)
{
}
