/*******************************************************************************************************
Описание: Файл с ПИД-регулятором
Разработчик: Тришин Вадим
Заметки: 
*******************************************************************************************************/
#include "control.h"
#include "motor_speed.h"
#include <stm32f10x.h>

/***************************************************************************************************
Локальные дефайны
***************************************************************************************************/

#define MAX_PID 24

/***************************************************************************************************
Локальные типы данных
***************************************************************************************************/


/***************************************************************************************************
Локальные переменные файла
***************************************************************************************************/


/***************************************************************************************************
Глобальные функции
***************************************************************************************************/

/**************************************************************************************************
Описание: Инициализация ПИД регулятора. Задание коэффицентов.
Аргументы:
* kP - пропорциональный коэффицент
* kI - интегральный коэффицент
* kD - дифференциальный коэффицент
Возврат: структура с заданными коэффицентами
Замечания: 
**************************************************************************************************/
params_PID init_PID (float kP, float kI, float kD)
{
  params_PID coefsPID;
  
  coefsPID.coefProp = kP;
  coefsPID.coefInt = kI;
  coefsPID.coefDif = kD;
  
  return coefsPID;
}

/**************************************************************************************************
Описание: Получение значения управляющего сигнала 
          на основе ошибки между желаемой и действительной скоростью
Аргументы: 
* coefs - структура с коэфицентами ПИДа
* mistake - значение ошибки управления
Возврат:   Значение управляющего сигнала
Замечания: 
**************************************************************************************************/
int16_t control_run(params_PID coefs, int16_t mistake)
{  
  // Предыдущая ошибка (сохроняется)
  static int16_t previousError = 0;
  // Интегральная сумма (накапливается)
  static int16_t integral      = 0;
  
  int16_t controlSignal = 0;
  int16_t difference    = 0;
  
  //********************* Надо добавить dt
  // Нахождение интеграла
  integral   += mistake;
  //Нахождение производной
  difference = mistake - previousError;
  
  // Дифференциальная составляющая
  controlSignal  = difference * coefs.coefDif;
  // Интегральная составляющая
  controlSignal += integral * coefs.coefInt;
  // Пропорциональная составляющая
  controlSignal += mistake * coefs.coefProp;
  // Сохранение ошибки
  previousError = mistake;
  
  return controlSignal;
}
