/*******************************************************************************************************
Definition: File with PID-regulator
Developer: Trishin Vadim
Notes: 
*******************************************************************************************************/
/*******************************************************************************************************
Описание: Файл с ПИД-регулятором
Разработчик: Тришин Вадим
Заметки: 
*******************************************************************************************************/
#include "control.h"
#include "motor_speed.h"
#include <stm32f10x.h>

/***************************************************************************************************
Local defines
***************************************************************************************************/
/***************************************************************************************************
Локальные дефайны
***************************************************************************************************/

/***************************************************************************************************
Local data types
***************************************************************************************************/
/***************************************************************************************************
Локальные типы данных
***************************************************************************************************/

/***************************************************************************************************
File local variables
***************************************************************************************************/
/***************************************************************************************************
Локальные переменные файла
***************************************************************************************************/

/***************************************************************************************************
Global functions
***************************************************************************************************/
/***************************************************************************************************
Глобальные функции
***************************************************************************************************/

/**************************************************************************************************
Definition: Get the control signal value depending on the desired velocity
Arguments: Control error
Return:   Control signal value
Notes: 
**************************************************************************************************/
/**************************************************************************************************
Описание: Получение значения управляющего сигнала 
          на основе ошибки между желаемой и действительной скоростью
Аргументы: Значение ошибки управления
Возврат:   Значение управляющего сигнала
Замечания: 
**************************************************************************************************/
int16_t control_run(int16_t mistake)
{
  const int16_t proportionalCoefficent = 0;
  // Reduced (приведенный)
  const int16_t integralCoefficent     = 0;
  // Reduced (приведенный)
  const int16_t differenceCoefficent   = 0;
  
  static int16_t previousError = 0;
  static int16_t integral      = 0;
  
  int16_t controlSignal = 0;
  int16_t difference    = 0;
  int16_t currentError  = 0;
  
//  currentError  = desiredSpeed - motor_speed_getSpeed();
  currentError = mistake;
  // Is it good integral?
  integral     += currentError; 
  difference    = currentError - previousError;
  
  controlSignal  = difference * differenceCoefficent;
  controlSignal += integral * integralCoefficent;
  controlSignal += currentError;
  controlSignal *= proportionalCoefficent;
  
  previousError = currentError;
  
  return controlSignal;
}
