/*******************************************************************************************************
Definition: File to set new voltage on motor
Developer: Sannikov Andrey
Notes: 
*******************************************************************************************************/
/*******************************************************************************************************
Описание: Файл для установки напряжения на мотор
Разработчик: Санников Андрей
Заметки: 
*******************************************************************************************************/
#include "motor_voltage.h"
#include <stm32f10x.h>
#include "stm32f10x.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_tim.h"

/***************************************************************************************************
Local defines
***************************************************************************************************/
/***************************************************************************************************
Локальные дефайны
***************************************************************************************************/
/***************************************************************************************************
Local data types
***************************************************************************************************/
/***************************************************************************************************
Локальные типы данных
***************************************************************************************************/
#define SYSCLK 72000000
#define PRESCALER 72
/***************************************************************************************************
File local variables
***************************************************************************************************/
/***************************************************************************************************
Локальные переменные файла
***************************************************************************************************/
GPIO_InitTypeDef port;
TIM_TimeBaseInitTypeDef timer;
TIM_OCInitTypeDef timerPWM;
 
int sound_time;
int sound_counter;
/***************************************************************************************************
Global functions
***************************************************************************************************/
/***************************************************************************************************
Глобальные функции
***************************************************************************************************/
/**************************************************************************************************
Описание: Инициализация пинов под ШИМ
Аргументы: Нет
Возврат:   Нет
Замечания: Нет
**************************************************************************************************/
void PWM_init()
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM1, ENABLE);
 
    GPIO_StructInit(&port);
    port.GPIO_Mode = GPIO_Mode_AF_PP;
    port.GPIO_Pin = GPIO_Pin_8;
	
    port.GPIO_Mode = GPIO_Mode_Out_PP;
    port.GPIO_Pin = GPIO_Pin_11;
	
    port.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIOA, &port);
	
    TIM_TimeBaseStructInit(&timer);
    timer.TIM_Prescaler = PRESCALER;
    timer.TIM_Period = SYSCLK / PRESCALER / 2000;
    timer.TIM_ClockDivision = 0;
    timer.TIM_CounterMode = TIM_CounterMode_Up;
		TIM_TimeBaseInit(TIM1, &timer);	
 
    TIM_OCStructInit(&timerPWM);
    timerPWM.TIM_OCMode = TIM_OCMode_PWM1;
    timerPWM.TIM_OutputState = TIM_OutputState_Enable;
    timerPWM.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OC1Init(TIM1, &timerPWM);
	
//		// Configure timer on interrupting by update 
//		TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);
//		//	NVIC_SetPriority(TIM1_UP_IRQn, 2);
//		// Enable interrupting from TIM1
//		NVIC_EnableIRQ(TIM1_UP_IRQn);
//	
//		// Turns on timer
//		TIM_Cmd(TIM1, ENABLE);
}

void motor_voltage_setVoltage(int16_t voltage)
{
	if (voltage < 0)
	{
		GPIO_SetBits(GPIOA, GPIO_Pin_11)
    TIM1->CCR1 = 2*voltage;
	}
	else
	{
		TIM1->CCR1 = 2*voltage;
	}		
}